Revit 2024 API
BuiltInFailures.ConnectorFailures.JointGenderMismatch Property
 The element has a connector with a fitting joint gender mismatch
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId JointGenderMismatch { get; }
Visual Basic
Public Shared ReadOnly Property JointGenderMismatch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ JointGenderMismatch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace